# Introduction to Machine Learning through Kaggle's Titanic

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Preface" data-toc-modified-id="Preface-0"><span class="toc-item-num">0&nbsp;&nbsp;</span>Preface</a></span><ul class="toc-item"><li><span><a href="#Motivation" data-toc-modified-id="Motivation-0.1"><span class="toc-item-num">0.1&nbsp;&nbsp;</span>Motivation</a></span></li><li><span><a href="#How-to-use-this-notebook-?" data-toc-modified-id="How-to-use-this-notebook-?-0.2"><span class="toc-item-num">0.2&nbsp;&nbsp;</span>How to use this notebook ?</a></span></li><li><span><a href="#Data-Science-brief-overview" data-toc-modified-id="Data-Science-brief-overview-0.3"><span class="toc-item-num">0.3&nbsp;&nbsp;</span>Data Science brief overview</a></span></li></ul></li><li><span><a href="#Simple-data-visualization-and-first-results" data-toc-modified-id="Simple-data-visualization-and-first-results-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Simple data visualization and first results</a></span><ul class="toc-item"><li><span><a href="#Storing-csv-as-dataframes" data-toc-modified-id="Storing-csv-as-dataframes-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Storing csv as dataframes</a></span></li><li><span><a href="#Simple-data-visualization-to-&quot;clean-the-dataset&quot;" data-toc-modified-id="Simple-data-visualization-to-&quot;clean-the-dataset&quot;-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Simple data visualization to "clean the dataset"</a></span><ul class="toc-item"><li><span><a href="#Simple-Visualization-functions" data-toc-modified-id="Simple-Visualization-functions-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Simple Visualization functions</a></span><ul class="toc-item"><li><span><a href="#df.head(n)-function" data-toc-modified-id="df.head(n)-function-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>df.head(n) function</a></span></li><li><span><a href="#df.shape-function" data-toc-modified-id="df.shape-function-1.2.1.2"><span class="toc-item-num">1.2.1.2&nbsp;&nbsp;</span>df.shape function</a></span></li><li><span><a href="#df.info()-function" data-toc-modified-id="df.info()-function-1.2.1.3"><span class="toc-item-num">1.2.1.3&nbsp;&nbsp;</span>df.info() function</a></span></li><li><span><a href="#df.isnull()-function" data-toc-modified-id="df.isnull()-function-1.2.1.4"><span class="toc-item-num">1.2.1.4&nbsp;&nbsp;</span>df.isnull() function</a></span></li><li><span><a href="#df.sum()-function" data-toc-modified-id="df.sum()-function-1.2.1.5"><span class="toc-item-num">1.2.1.5&nbsp;&nbsp;</span>df.sum() function</a></span></li></ul></li><li><span><a href="#Results-of-simple-visualization:-basic-data-cleansing" data-toc-modified-id="Results-of-simple-visualization:-basic-data-cleansing-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Results of simple visualization: basic data cleansing</a></span><ul class="toc-item"><li><span><a href="#Drop-of-a-column-(df.drop()-function)" data-toc-modified-id="Drop-of-a-column-(df.drop()-function)-1.2.2.1"><span class="toc-item-num">1.2.2.1&nbsp;&nbsp;</span>Drop of a column (df.drop() function)</a></span></li><li><span><a href="#Fill-NULL-values-in-a-column" data-toc-modified-id="Fill-NULL-values-in-a-column-1.2.2.2"><span class="toc-item-num">1.2.2.2&nbsp;&nbsp;</span>Fill <em>NULL</em> values in a column</a></span></li></ul></li></ul></li><li><span><a href="#Feature-Engineering" data-toc-modified-id="Feature-Engineering-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Feature Engineering</a></span><ul class="toc-item"><li><span><a href="#First-analysis-of-the-dataset" data-toc-modified-id="First-analysis-of-the-dataset-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>First analysis of the dataset</a></span></li><li><span><a href="#Changes-to-implement-in-the-dataset" data-toc-modified-id="Changes-to-implement-in-the-dataset-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Changes to implement in the dataset</a></span><ul class="toc-item"><li><span><a href="#Dropping-columns" data-toc-modified-id="Dropping-columns-1.3.2.1"><span class="toc-item-num">1.3.2.1&nbsp;&nbsp;</span>Dropping columns</a></span></li><li><span><a href="#Categorizing-string-column-with-numeric-categories" data-toc-modified-id="Categorizing-string-column-with-numeric-categories-1.3.2.2"><span class="toc-item-num">1.3.2.2&nbsp;&nbsp;</span>Categorizing string column with numeric categories</a></span></li></ul></li><li><span><a href="#Training-and-testing-set" data-toc-modified-id="Training-and-testing-set-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Training and testing set</a></span><ul class="toc-item"><li><span><a href="#Splitting-training-data-into-training-set-and-target-vector" data-toc-modified-id="Splitting-training-data-into-training-set-and-target-vector-1.3.3.1"><span class="toc-item-num">1.3.3.1&nbsp;&nbsp;</span>Splitting training data into training set and target vector</a></span></li><li><span><a href="#Splitting-the-training-set-into-a-training-set-and-a-testing-set" data-toc-modified-id="Splitting-the-training-set-into-a-training-set-and-a-testing-set-1.3.3.2"><span class="toc-item-num">1.3.3.2&nbsp;&nbsp;</span>Splitting the training set into a training set and a testing set</a></span></li></ul></li></ul></li><li><span><a href="#Machine-learning-modelling" data-toc-modified-id="Machine-learning-modelling-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Machine learning modelling</a></span><ul class="toc-item"><li><span><a href="#Cross-Validation-(K-fold)" data-toc-modified-id="Cross-Validation-(K-fold)-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>Cross Validation (K-fold)</a></span></li><li><span><a href="#Logistic-Regression" data-toc-modified-id="Logistic-Regression-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span>Logistic Regression</a></span></li><li><span><a href="#K-nearest-neighbors-classifier" data-toc-modified-id="K-nearest-neighbors-classifier-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>K-nearest-neighbors classifier</a></span></li><li><span><a href="#Naive-Bayes-classifier" data-toc-modified-id="Naive-Bayes-classifier-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span>Naive Bayes classifier</a></span></li><li><span><a href="#Decision-Tree-classifier" data-toc-modified-id="Decision-Tree-classifier-1.4.5"><span class="toc-item-num">1.4.5&nbsp;&nbsp;</span>Decision Tree classifier</a></span></li><li><span><a href="#Random-Forest-classifier" data-toc-modified-id="Random-Forest-classifier-1.4.6"><span class="toc-item-num">1.4.6&nbsp;&nbsp;</span>Random Forest classifier</a></span></li><li><span><a href="#Support-Vector-Machine-(SVM)" data-toc-modified-id="Support-Vector-Machine-(SVM)-1.4.7"><span class="toc-item-num">1.4.7&nbsp;&nbsp;</span>Support Vector Machine (SVM)</a></span></li></ul></li><li><span><a href="#Submission" data-toc-modified-id="Submission-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Submission</a></span><ul class="toc-item"><li><span><a href="#Apply-changes-to-the-testing-set" data-toc-modified-id="Apply-changes-to-the-testing-set-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>Apply changes to the testing set</a></span></li><li><span><a href="#Fitting-the-model-and-prediction" data-toc-modified-id="Fitting-the-model-and-prediction-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Fitting the model and prediction</a></span></li><li><span><a href="#Putting-the-results-in-a-csv-to-upload" data-toc-modified-id="Putting-the-results-in-a-csv-to-upload-1.5.3"><span class="toc-item-num">1.5.3&nbsp;&nbsp;</span>Putting the results in a csv to upload</a></span></li></ul></li></ul></li><li><span><a href="#Advanced-data-visualization-and-results" data-toc-modified-id="Advanced-data-visualization-and-results-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Advanced data visualization and results</a></span></li><li><span><a href="#Useful-reads-and-references:" data-toc-modified-id="Useful-reads-and-references:-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Useful reads and references:</a></span></li></ul></div>

## Preface
### Motivation


This notebook is meant to serve as a support to people wanting to know more about Machine Learning. It comes as a support for the Titanic competition on Kaggle.

### How to use this notebook ?

This notebook is published on GitHub. To access it interactively, you can do the following:
    - Download Anaconda
    - Go to the GitHub repository and download the file 
    - Transfer the files to Jupyter Lab
    - Open the .ipynb after having put the csv in a folder called 'Data' as in the Gitub repository 
    
    
### Data Science brief overview

The data provided in this competition __has already been transformed__ as it is already in a __"clean csv file"__. Do note that in many cases, data has to be collected manually/automatically through complex __Data Engineering tasks__. Here, these steps have already been taken care of ! You are not asked to do any research or __compare multiple sources__ which often happens in the "real world" !

<img src='Images/Data Science Hierarchy of needs.png' width="500">

Here, we will only begin at the third step __"Explore/transform"__ or even the fourth one __"Aggregate/Label"__. For example, we do not care about: 
- How did we collect the data ? Manually ? Through an automated data flow ? Extract from a database ? Scraping ? etc.
- How is the data stored and the tables populated ? This is particularly important when we deal with a lot of data. These __Data Engineering Tasks__ include:
    - Should we physically store the data into hard disks or should we use cloud services (Amazon Web Services, Google Cloud etc.) 
    - Is the data refreshed automatically ? And when do we need to refresh it 
    
If the distinction between __data science__ and __data engineering__ is not perfectly clear or you want to learn more about Data Engineering, you might want to read the following: https://towardsdatascience.com/who-is-a-data-engineer-how-to-become-a-data-engineer-1167ddc12811

## Simple data visualization and first results 
We begin by __importing pandas library__ which is the most widely used library for data manipulation and analysis. It will enable us to: 
* convert csv files into dataframes. Dataframes are data structures that are much more efficient to perform data manipulation.

In [1]:
import pandas as pd

### Storing csv as dataframes 

Here, we use the read_csv function that reads csv files and put them in a dataframe. To know more about dataframes you can go to the following link: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

In [2]:
train = pd.read_csv('Data/train.csv')
test = pd.read_csv('Data/test.csv')

### Simple data visualization to "clean the dataset"
Then, once we have these clean data structures, we try to __visualize__ the data to see what steps we can perform to have a __clean dataset__

#### Simple Visualization functions
##### df.head(n) function
This function takes the n first rows of the dataframe df. This function is really useful to know what your data looks like.

In [3]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

We can see that the only difference between the training and the testing set is that the testing set does not contain the data we want to "guess" which is whether the passenger has survived or not.

##### df.shape function
This function gives the shape of the dataframe df as follows: (number of lines, number of columns)

In [5]:
train.shape

(891, 12)

In [6]:
test.shape

(418, 11)

##### df.info() function

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [8]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

##### df.isnull() function
This function transforms the dataframe df by replacing each and every cell by the boolean: 
* True if the cell contains the value NULL
* False if the cell contains a value different than NULL

In [9]:
train.isnull().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

##### df.sum() function
This function sums the different columns of the dataframe df. Please not that the sum function depends on the data type. A sum of floats will be equivalent to the usual addition as shown in the examples below.
The pd.Dataframe function here converts a list to a dataframe to which we then apply the sum() function.

In [10]:
pd.DataFrame([1,2,3,4,5]).sum()

0    15
dtype: int64

In [11]:
pd.DataFrame(['a','b','c','d','e',]).sum()

0    abcde
dtype: object

__We will here use the sum function to know how many rows of the sets have _NULL_ values.__ Generally in data science, we try to avoid as much as possible _NULL_ values that are not supposed to be _NULL_ (e.g. relevant features to train the model).

In [12]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

We can see that a lot of Age values are _NULL_ and most Cabin values are _NULL_. Do not that ths information already existed in the df.info() function used above.

When confronted with _NULL_ values, __existing techniques__ include:
1. dropping the column if we assume that it won't be an important feature
2. try to fill the column with the value that should be there

We will __apply 1. to Cabin and 2. to Age__. I specifically chose to highlight the two methods but some interesting analysis could of course have been made with the Cabin column.

#### Results of simple visualization: basic data cleansing


##### Drop of a column (df.drop() function)
The function df.drop("ColumnName", axis=1, inplace=True) will delete the column called "ColumnName" from the dataframe df. 
- The parameter axis=1 specifies that we want to drop a column and not a line
- The parameter inplace=True specifies that we want to affect directly the variable _train_

In [13]:
train.drop("Cabin", axis=1, inplace=True)

In [14]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

We can see that the Cabin column has been removed. 

When we want to apply modifications to the training set, we might as well want to apply the same changes to the testing set to be consistent. For educational puroses, I will apply all the changes at the end to the testing set as a heads up on what has been done.

In [15]:
#test.drop("Cabin", axis=1, inplace=True)
#test.head(5)

##### Fill _NULL_ values in a column

In [16]:
train["Age"].fillna(train["Age"].median(), inplace= True)

In [17]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.6+ KB

We now have a consistent training set, which does not contain any _NULL_ values. The question is now, which column should we use to have the best prediction score.

### Feature Engineering 

Feature engineering is the process of using __domain knowledge of the data__ to create features that make machine learning algorithms work.

#### First analysis of the dataset

The __feature engineering__ reflection 
__Information given by Kaggle:__ 
- Survived: 0 = No, 1 = Yes
- Pclass: Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd
- SibSp: # of siblings / spouses aboard the Titanic
- Parch: # of parents / children aboard the Titanic
- Ticket: Ticket number
- Cabin: Cabin number
- Embarked: Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton

In [18]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

From reading the dataset, we can come to the following conclusions

| PassengerId | Survived | Pclass | Name | Sex | Age | SibSp | Parch | Ticket | Fare | Embarked |
| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | 
| Useless as it is arbitrary | Should be dropped from the training data and put in a target vector  | Categorical variable, already numeric | Seems useless at first glance so can be dropped at first, we will do some interesting analysis on the title in more advanced sections | Categorical variable, not numerical. Should be numerical, we will here apply "binning" to encode this categorical variable | We have filled null values with median of the whole group, more advanced techniques will be used in 2. | Categorical variable, already numerical | Categorical variable, already numerical | Complicated column so can be dropped at first, will be categorized in section 2. |  Continuous variable, seems interesting to keep | Categorical variable, not numerical. Should be numerical, we will here apply "binning" to encode this categorical variable |
| __to drop__ | __to drop from training set and to put in target vector__ |__can be kept like this__| __can be dropped at first__ | __has to be encoded in "numerical categories"__ | __can be kept like this, can also be encoded into "numercal categories"__ | __can be kept like this__ | __can be kept like this__ | __can be dropped at first__ | __can be kept like this__ | __has to be encoded in "numerical categories"__ |

#### Changes to implement in the dataset

To sum up the above table, one of the following should happen to each column:

1. the column has to be dropped 
2. the column has to be categorized 
3. the column can be used like this

##### Dropping columns
With the analysis above, we have decided that some columns could either:
- at first be dropped (because analysis is too complex: __Name, Ticket__)
- simply dropped because they are useless (__PassengerId__) 

Like in 1.2.2.1, we will use the df.drop() function

In [19]:
train.drop(["PassengerId", "Name", "Ticket"], axis=1, inplace=True)

In [20]:
train.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

##### Categorizing string column with numeric categories

Now we need to categorize

For the other categorical data, pandas' get_dummies is really useful. It adds columns corresponding to all the possible values. So, if there could be three embarkment values — Q, C, S, the get_dummies method would create three different columns and assign values 0 or 1 depending on the embarking point.

In [21]:
embarked=pd.get_dummies(train["Embarked"], prefix='Emb')

In [22]:
embarked.head(5)

   Emb_C  Emb_Q  Emb_S
0      0      0      1
1      1      0      0
2      0      0      1
3      0      0      1
4      0      0      1

The __drop_first=True__ drops one column from the resulted dummy features. The purpose is to avoid multicollinearity. Here is the results:

In [23]:
embarked=pd.get_dummies(train["Embarked"], prefix='Emb', drop_first=True)

In [24]:
embarked.head(5)

   Emb_Q  Emb_S
0      0      1
1      0      0
2      0      1
3      0      1
4      0      1

We can now do the same with the 'Sex' column. We will also drop the first column to avoid multicollinearity.

In [25]:
sex=pd.get_dummies(train["Sex"], prefix='Sex', drop_first=True)

In [26]:
sex.head(5)

   Sex_male
0         1
1         0
2         0
3         0
4         1

We now have to concatenate these columns with the _train_ dataframe. We use the pandas' concat function with _axis=1_ to mention that we want to concatenate columns.

In [27]:
train=pd.concat([train, embarked, sex], axis=1)

In [28]:
train.head(5)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Emb_Q,Emb_S,Sex_male
0,0,3,male,22.0,1,0,7.2500,S,0,1,1
1,1,1,female,38.0,1,0,71.2833,C,0,0,0
2,1,3,female,26.0,0,0,7.9250,S,0,1,0
3,1,1,female,35.0,1,0,53.1000,S,0,1,0
4,0,3,male,35.0,0,0,8.0500,S,0,1,1

We now have to drop the columns we have modified and concatenated.

In [29]:
train.drop(["Sex", "Embarked"], axis=1, inplace=True)

In [30]:
train.head(5)

   Survived  Pclass   Age  SibSp  Parch     Fare  Emb_Q  Emb_S  Sex_male
0         0       3  22.0      1      0   7.2500      0      1         1
1         1       1  38.0      1      0  71.2833      0      0         0
2         1       3  26.0      0      0   7.9250      0      1         0
3         1       1  35.0      1      0  53.1000      0      1         0
4         0       3  35.0      0      0   8.0500      0      1         1

#### Training and testing set

We now have two necessary step before running machine learning algorithms:
1. Splitting the current training set in a training set (with all the features) and a target vector (with the column 'Survived')
2. Splitting the training materials (training data and target vector) into training + testing in order to see the efficiency of our model as we do not have any labeled data for the current testing set.

##### Splitting training data into training set and target vector

In [31]:
y=train["Survived"]
X=train.drop("Survived", axis=1)

In [32]:
y.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [33]:
X.head(5)

   Pclass   Age  SibSp  Parch     Fare  Emb_Q  Emb_S  Sex_male
0       3  22.0      1      0   7.2500      0      1         1
1       1  38.0      1      0  71.2833      0      0         0
2       3  26.0      0      0   7.9250      0      1         0
3       1  35.0      1      0  53.1000      0      1         0
4       3  35.0      0      0   8.0500      0      1         1

##### Splitting the training set into a training set and a testing set

Here, __test_size=0.2__ will do the following:
- 20% of rows will be in the testing set
- 80% of rows will be in the training set

In [34]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2)

We now have a dataset ready. In the next sessions we will FINALLY be able to run our first Machine Learning algorithms on the titanic dataset !!

### Machine learning modelling

#### Cross Validation (K-fold)

In [35]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold = KFold(n_splits=10, shuffle=True, random_state=0)

In [36]:
type(k_fold)

sklearn.model_selection._split.KFold

#### Logistic Regression
Here we will use the logistic function built within scikit. 
To learn more about its parameters and how it works, you can go to the https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html

In [37]:
from sklearn.linear_model import LogisticRegression
classifier=LogisticRegression(solver='liblinear') #liblinear is optimal for small data sets
classifier.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='liblinear',
          tol=0.0001, verbose=0, warm_start=False)

In [38]:
predictions=classifier.predict(X_test)

Lets use build functions to see the accuracy of our first machine learning algorithm.

In [39]:
from sklearn.metrics import classification_report
print(classification_report(y_test, predictions))

              precision    recall  f1-score   support

           0       0.80      0.81      0.80       104
           1       0.73      0.72      0.72        75

   micro avg       0.77      0.77      0.77       179
   macro avg       0.76      0.76      0.76       179
weighted avg       0.77      0.77      0.77       179

In [40]:
scoring='accuracy'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.81944444 0.75       0.8028169  0.81690141 0.84507042 0.84507042
 0.81690141 0.8028169  0.71830986 0.8028169 ]

In [41]:
#Logistic Regression score
import numpy as np
LR_score = round(np.mean(score)*100, 2)
print(LR_score)

80.2

Lets now add the score to a dictionnary. We will use multiple machine learning techniques and we want to siply have an overview and see which one is the best one.

In [42]:
scores={}
scores['LR']=LR_score
print(scores)

{'LR': 80.2}

If you do not get why we use all these parameters, you might want to:
- search for cross_val_score function in the official documentation
- search for k-fold validation
- have a look at the image below to understand why I chose 'accuracy' for scoring. I might as well have chosen precision, accracy or recall.

In [43]:
from IPython.display import Image
Image(url= "https://miro.medium.com/max/1020/1*uR09zTlPgIj5PvMYJZScVg.png", width=400)

You might want to have a look at this article to have a quick overview of these notions: https://towardsdatascience.com/accuracy-precision-recall-or-f1-331fb37c5cb9

Let's try different scoring methods for this one:

In [44]:
scoring='precision'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.75       0.52631579 0.9047619  0.84210526 0.73684211 0.85
 0.875      0.75       0.66666667 0.875     ]

It is interesting to see for yourself why scroes are different using these scoring types. A good understanding of the diagram above and the interest of these scoring types is really helpful.

In [45]:
scoring='recall'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.82758621 0.52631579 0.61290323 0.61538462 0.7        0.68
 0.67741935 0.69230769 0.57142857 0.65625   ]

#### K-nearest-neighbors classifier

If you want to learn more about k-nearest-neighbours classifier, you can have a look at this article: https://towardsdatascience.com/machine-learning-basics-with-the-k-nearest-neighbors-algorithm-6a6e71d01761

In [46]:
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier(n_neighbors = 6)
scoring = 'accuracy'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring='accuracy')
print(score)

[0.65277778 0.75       0.61971831 0.70422535 0.77464789 0.71830986
 0.70422535 0.66197183 0.77464789 0.66197183]

In [47]:
#kNN score 
import numpy as np
kNN_score = round(np.mean(score)*100, 2)
scores['kNN']=kNN_score
print(scores)

{'LR': 80.2, 'kNN': 70.22}

Here, you might have noticed that I chose a random number for the number of neighbors. You might want to dive deep a little into that, rather than just using a random number. One technique is presented below.

In [48]:
accuracy_list=[]
for i in range (1,100):
    from sklearn.neighbors import KNeighborsClassifier
    classifier = KNeighborsClassifier(n_neighbors = i)
    scoring = 'accuracy'
    score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring='accuracy')
    accuracy_list.append(round(np.mean(score)*100, 2))

In [49]:
import matplotlib.pyplot as plt
a=[i for i in range(1,100)]
plt.plot(accuracy_list)

I let you think and see why / if this is relevant.

#### Naive Bayes classifier

In [50]:
from sklearn.naive_bayes import GaussianNB
classifier = GaussianNB()
scoring = 'accuracy'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.76388889 0.72222222 0.8028169  0.8028169  0.85915493 0.85915493
 0.8028169  0.77464789 0.73239437 0.78873239]

In [51]:
NB_score = round(np.mean(score)*100, 2)
print(NB_score)
scores['NB']=NB_score
print(scores)

79.09
{'LR': 80.2, 'kNN': 70.22, 'NB': 79.09}

#### Decision Tree classifier

In [52]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier()
scoring = 'accuracy'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.80555556 0.75       0.78873239 0.83098592 0.81690141 0.83098592
 0.78873239 0.81690141 0.71830986 0.8028169 ]

In [53]:
DT_score= round(np.mean(score)*100, 2)
print(DT_score)
scores['DT']=DT_score
print(scores)

79.5
{'LR': 80.2, 'kNN': 70.22, 'NB': 79.09, 'DT': 79.5}

#### Random Forest classifier

In [54]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(n_estimators=13)
scoring = 'accuracy'
score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.76388889 0.81944444 0.81690141 0.74647887 0.87323944 0.88732394
 0.77464789 0.81690141 0.8028169  0.83098592]

In [55]:
RF_score = round(np.mean(score)*100, 2)
print(RF_score)
scores['RF']=RF_score
print(scores)

81.33
{'LR': 80.2, 'kNN': 70.22, 'NB': 79.09, 'DT': 79.5, 'RF': 81.33}


#### Support Vector Machine (SVM)

In [56]:
from sklearn.svm import SVC
classifier = SVC()
scoring = 'accuracy'
#score = cross_val_score(classifier, X_train, y_train, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.76388889 0.81944444 0.81690141 0.74647887 0.87323944 0.88732394
 0.77464789 0.81690141 0.8028169  0.83098592]

In [57]:
SV_score = round(np.mean(score)*100, 2)
print(SV_score)
scores['SV']=SV_score
print(scores)

81.33
{'LR': 80.2, 'kNN': 70.22, 'NB': 79.09, 'DT': 79.5, 'RF': 81.33, 'SV': 81.33}

### Submission

Apparently, scores are higher using the random forest classifier. Let's submit our scores using this on random forest classifier.

#### Apply changes to the testing set
We first need to apply the same changes to the testing set than we applied to the training set. Normally, it is convenient to modify both the training and testing set together. But for educational purposes, I chose to put them here so we can see what has happened so far to the training and testing set.

In [58]:
test.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [59]:
# drop of the Cabin column which has too many NULL values
test.drop("Cabin", axis=1, inplace=True)


# filling Age column with the median age in the tesing set
test["Age"].fillna(test["Age"].median(), inplace= True)


# drop of Name and Ticket columns that cannot be easily categorized or quantified. Advanced analysis will be made later.
test.drop(["Name", "Ticket"], axis=1, inplace=True)


# categorization of 'Embarked' and 'Sex' columns
embarked=pd.get_dummies(test["Embarked"], prefix='Emb', drop_first=True)
sex=pd.get_dummies(test["Sex"], prefix='Sex', drop_first=True)


# concatenation of the testing set with the newly created columns 'sex' and 'embarked'
test=pd.concat([test, embarked, sex], axis=1)


# drop of the old columns to avid both multicollinearity and incooncsistency. We try here to numerically categorize string columns !!
test.drop(["Sex", "Embarked"], axis=1, inplace=True)

#### Fitting the model and prediction

In [60]:
classifier=LogisticRegression(solver='liblinear') #liblinear is optimal for small data sets
classifier.fit(X_train, y_train)

testing = test.drop("PassengerId", axis=1)
testing['Fare'].fillna(0, inplace=True)
prediction = classifier.predict(testing)

#### Putting the results in a csv to upload

In [61]:
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": prediction
    })

submission.to_csv('Data/submission.csv', index=False)

In [62]:
submission = pd.read_csv('Data/submission.csv')
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

## Advanced data visualization and results

##  Useful reads and references:
- Machine Learning Classifiers, Sidath Asiri, https://towardsdatascience.com/machine-learning-classifiers-a5cc4e1b0623
- Understanding Confusion Matrix, Sarang Narkhede, https://towardsdatascience.com/understanding-confusion-matrix-a9ad42dcfd62
- Understaning AUC-ROC Curve, Sarang Narkhede, https://towardsdatascience.com/understanding-auc-roc-curve-68b2303cc9c5
- Accuracy, precision, recal or F1, Koo Pinh Shung, https://towardsdatascience.com/accuracy-precision-recall-or-f1-331fb37c5cb9

In [63]:
from IPython.display import Image
Image(url= "https://miro.medium.com/max/484/1*2lptVD05HarbzGKiZ44l5A.png")